app/views/static/index.html.erb


<% Potin.all.each do |potin| %>
<div class="card text-white bg-secondary mb-3" style="max-width: 20rem;">
  <div class="card-header"><%= potin.author.first_name %> <%= potin.author.last_name %></div>
---
SELECT "potins".* FROM "potins"
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]