app/controllers/static_controller.rb

INSERT INTO "authors" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-10-28 15:15:17.777323"], ["updated_at", "2019-10-28 15:15:17.777323"]]
UPDATE "authors" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["first_name", "Manon"], ["last_name", "dupont"], ["updated_at", "2019-10-28 15:24:44.992864"], ["id", 7]]
INSERT INTO "potins" ("author_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["author_id", 7], ["created_at", "2019-10-28 15:24:45.008765"], ["updated_at", "2019-10-28 15:24:45.008765"]]
UPDATE "potins" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "potins"."id" = $4  [["content", "les iPhones bla bla bla, bla bla bla toto coco jojo."], ["title", "Iphone 11"], ["updated_at", "2019-10-28 15:24:45.011192"], ["id", 4]]
---
  def new_gossip_post
   puts "Hello depuis le serveur"
   a = Author.create
   a.first_name = params["first_name"]
   a.last_name = params["last_name"]
   a.save
   u = Potin.create(author: a)
   u.title = params["title"]
   u.content = params["content"]
   u.save